# PyCitySchools

### Import data

In [1]:
# Add the Pandas dependency
import pandas as pd

In [2]:
# Files to load (DIRECT PATH)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Can also use the os.path.join() to load files indirectly from directory
# import pandas as pd
# import os
# school_data_to_load = os.path.join("Resources", "schools_complete.csv")  ** might need more to directory!
# student_data_to_load = os.path.join("Resources", "students_complete.csv")

# Store as a df
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

# if File Not Found, use os.path.join method (but worked)

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [3]:
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

### Data Cleaning

#### Missing Data

In [4]:
# Cleaning - Count()
# Determine if there are any missing values in the school data.
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [5]:
# Determine if there are any missing values in the student data.
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [6]:
# Cleaning - isnull()
# Determine if there are any missing values in the school data.
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [7]:
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [8]:
# Get a count of how many missing values there are - isnull().sum() [chaining]
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [9]:
# Cleaning - missing values (opposite direction) - notnull() ... True where not empty
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [10]:
# And chaining again ... notnull().sum()
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [11]:
# MISSING DATA - see cleaning_data.ipynb for results
# Add the Pandas dependency
#import pandas as pd

# Files to load
#file_to_load = "Resources/missing_grades.csv"

# Read the CSV into the df
#missing_grade_df = pd.read_csv(file_to_load)
#missing_grade_df
# See two NaN - Nota number != 0

#  Missing Data - Option 1: Do nothing
# NANs will not be considered in sum or averages; will impact multiplication, division

# Missing Data - Option 2: Drop the Row - dropna()
# Need to consider
#  1. How much data would be removed if NaNs are dropped?
#  2. How would this loss affect the analysis?
#missing_grade_df.dropna()

# Missing Data - Option 3: Fill in the Row - Proceed with caution ... fillna()
#  Note: Using 0 can impact arithmetic calculations ... here - arbitrary 85
#missing_grade_df.fillna(85)

#### Determining Data Types

In [12]:
# Determining data types
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [13]:
# Can also check dtype on a single column ... df.column.dtype (no space) or df["column"].dtype (with space)
# student_data_df.budget.dtype vs student_data_df["Student ID"].dtype
# technically can be student_data_df["budget"].dtype too
student_data_df["Student ID"].dtype

dtype('int64')

In [14]:
student_data_df.dtypes
# Appears no conversions needed at this time ...

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

#### Replacing Data

In [15]:
# Data Cleaning ... See cleaning_student_names.ipynb
# Remove odd things (like professional prefixes and suffixes, but not family-related suffixes)
# EDA and testing to determine how to clean ...

# 4.5.6 Replace Substrings
# Simplest way:
# 1. Declare a list to hold the common prefixes and suffixes
# 2. Iterate through with a for loop
# 3. For each item in the list, use replace() on the student_name column

# NOTE: replace() works on Python string only and student_data_df.dtypes["student_name"] > object
# Need to convert the object to a string with str attribute (can chain two processes) with:
# df["col"].str.replace()

In [16]:
# Based on prior work in cleaning_student_names.ipynb, will create a list to hold common prefixes and suffixes
#  and iterate through the list with the replace() method (string only).
#  Add each prefix and suffix to remove to a list.
#  Remember the whitespace issue addressed earlier.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

student_data_df.head(5)

C:\Users\flasu\AppData\Local\Temp/ipykernel_24724/3471779981.py:9: FutureWarning: The default value of regex will change from True to False in a future version.
  student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

## School Analysis

In [17]:
# Task #1: Quick snapshot ... need school district summary: key metrics
# 1. Total number of students - 39,170
# 2. Total number of schools - 15
# 3. Total budget - $24,649,428
# 4. Avg math score - 78.99%
# 5. Avg reading score - 81.88%
# 6. Passed math - % students - 75%
# 7. Passed reading - % students - 85.8%
# 8. Overall passing percentage - 65%

# While can pull data from both tables, more efficient to merge on common column: school_name [default = inner join]

In [18]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()
# NOTE: WANT A MERGE THAT ENDS UP WITH WHAT'S BELOW - ie, student,school df order - ORDER MATTERS! or get reverse

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

### Student Count

In [19]:
# Get the number of students - count()
# A check on full df shows no missing values (39,170 for all headers)
# student_count_all = school_data_complete_df.count()
# student_count_all

# Can simplify with gathering a count for the specific column of interest - eg: Student ID
student_count = school_data_complete_df["Student ID"].count()
student_count

# Don't forget - [""] with spaces ... ok to use even if no spaces
# Also good we didn't drop anything or the numbers would be off
# Not discussed - why 85 chosen ... do we know it's an average already? Seems backwards ...

39170

### School Count

In [20]:
# Get the number of schools ... two ways
# Option #1 - go back to original worksheet with count()
school_count = school_data_df["school_name"].count()
school_count

15

In [21]:
# Get the number of schools ... two ways
# Option #2 - unique()
# school_count = school_data_complete_df["school_name"].count()  # leads to 39,170
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [22]:
# But need the unique COUNT of the array, so actual code should be ... len() + unique()
school_count_3 = len(school_data_complete_df["school_name"].unique())
school_count_3

15

### District Budget

In [23]:
# Total budget for the whole district - sum()
# Applying sum() on school_data_complete_df will lead to the sum of all the schools in duplicate
# Instead, need to run on the school_data_df
# Calculate the total budget
total_budget = school_data_df["budget"].sum()
total_budget

24649428

### Math & Reading Scores

In [24]:
# Get the average reading score - mean()Score Averages - mean()
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [25]:
# Get the average math score - mean()
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [26]:
# To print together if wanted ...
#print(average_reading_score)
#print(average_math_score)

In [27]:
# Get the overall passing percentage

# To get the % of students who passed math and reading
# 1. Determine passing grade
# 2. Get number of students who passed into two different subject df
# 3. Calculate # who passed both
# 4. Calculate % who passed both

# To get the overall passing %
# 1. Get number of students who passed both into df
# 2. Calculate # who passed both
# 3. Calculate % who passed both

In [28]:
# Determine the passing grade
# Per school district, >= 70 is passing
passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70

In [29]:
# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [30]:
# Get all the students who are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]

In [31]:
# Calculate the number of students passing math.
passing_math_count = passing_math["student_name"].count()

# Calculate the number of students passing reading.
passing_reading_count = passing_reading["student_name"].count()

In [32]:
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [33]:
# Get the percentage of students who passed math and reading
# Know from previous work that there are 39,170 students
# Because %, need to convert student_count to a float
passing_math_percentage = passing_math_count / float(student_count) * 100
passing_reading_percentage = passing_reading_count / float(student_count) * 100

In [34]:
print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [35]:
# Calculate the overall passing percentage - logical operator "&" applied to >=70 math and reading
# passed both / total students
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) 
                                               & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [36]:
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [37]:
# Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

#### New DF: District Summary

In [38]:
# Create a new District Summary df
# Combine all metrics into a single df
# One way to do this is to convert a list of dictionaries to a df

# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame(
          [{"Total Schools": school_count,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,
         "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": overall_passing_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

##### Formatting Needed

In [39]:
# Formatting needed:
# 1. Budget - two decimal places
# 2. Grade avgs - one decimal places (10th)
# 3. Grade % - nearest whole percent
# 4. Add a thousands separator for numbers greater than 1,000

# Fuction: map()
# Used for substituting each value in a Series with another value
# Best to convert an algorithm with repetitive tasks into a function (smaller, more managable code)
# Helps avoid syntax errors etc.

# Four basic parts
# 1. Name
# 2. Parameters (value sent to fxn, aka parameter)
# 3. Code block (statements to perform task)
# 4. Return value (what the fxn gives back at completion

# def used to define/create the fxn
# return causes fxn to end

In [40]:
# Define a function that calculates the percentage of students who passed both 
# math and reading and returns the passing percentage when the function is called.

def passing_math_percent(pass_math_count, student_count):
    return pass_math_count / float(student_count) * 100

In [41]:
passing_math_count = 29370
total_student_count = 39170

In [42]:
# Call the function.
# Note: Have to assign the number of parameters assigned to the fxn or will throw an error
#  Probably doesn't have to be all??? Think of those other fxns out there ... but prob need what's needed to work!
passing_math_percent(passing_math_count, total_student_count)

74.9808526933878

In [43]:
# Formatting
# Can chain map() and format() fxns
# Use basic syntax of df["column"] = df["column"].map("{:,}".format)

# NOTE: map() fxn allows for processing and transforming items of an iterable without creating a FOR LOOP
# https://realpython.com/python-map-function/

In [44]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [45]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [46]:
# Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [47]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [48]:
# HOW TO REORDER - But in order already

# Pass a list with square brackets to say "keep in this order"

# Reorder the columns in the order you want them to appear.
# new_column_order = ["column2", "column4", "column1"]
# Also allows you to filter out unwanted columns by not including them

# Assign a new or the same DataFrame the new column order.
# df = df[new_column_order]

# For this assignment, if not already in order
# new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", 
#                    "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
# district_summary_df = district_summary_df[new_column_order]
# district_summary_df